АлогистикТест2/src/DataProcessors/алк_ПоказателиПиловочникВСводку/алк_ПоказателиПиловочникВСводку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_ПоказателиПиловочникВСводку</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыОрганизации/алк_ЗапасыОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыОрганизации</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСменыНов</name>
    <comment>Для перемещения из измерения в реквизит</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/DataProcessors/алк_ПоказателиПиловочникВСводку/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьОстаткиНаСервере()
	
ОстаткиЛесаПилмат = Новый Структура("ОстатокБиржаФактСутки, ОстатокБиржа12ФактСутки, ОстатокБиржа3ФактСутки, ОстатокБиржаОХФактСутки,
	| ОстатокБиржаФактНараст, ОстатокБиржа12ФактНараст, ОстатокБиржа3ФактНараст, ОстатокБиржаОХФактНараст,
	| ОстатокБиржа12ФактФинал, ОстатокБиржа3ФактФинал, ОстатокБиржаОХФактФинал", 0,0,0,0,0,0,0,0,0,0,0);
	
	
	Сорт12 = Справочники.Сорта.НайтиПоНаименованию("1-2 сорт", Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
	Сорт13 = Справочники.Сорта.НайтиПоНаименованию("1-3 сорт", Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
	Сорт3  = Справочники.Сорта.НайтиПоНаименованию("3 сорт",   Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(алк_ЗапасыОрганизацииОстаткиИОбороты.ОбъемКонечныйОстаток, 0)) КАК ОбъемОстаток
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , СтруктурнаяЕдиница = &П1) КАК алк_ЗапасыОрганизацииОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("П1", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.Период));
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаРезультата = РезультатЗапроса.Выбрать();
		ВыборкаРезультата.Следующий();
		
		ОстаткиЛесаПилмат.ОстатокБиржаФактСутки  = ВыборкаРезультата.ОбъемОстаток;
		ОстаткиЛесаПилмат.ОстатокБиржаФактНараст = ВыборкаРезультата.ОбъемОстаток;
		
	КонецЕсли; 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(алк_ЗапасыОрганизацииОстаткиИОбороты.ОбъемКонечныйОстаток) КАК ОбъемОстаток,
	|	алк_ЗапасыОрганизацииОстаткиИОбороты.Ячейка.Несоответствие КАК Ответхранение,
	|	алк_ПараметрыХарактеристик.Сорт КАК Сорт
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , СтруктурнаяЕдиница = &П1) КАК алк_ЗапасыОрганизацииОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ЗапасыОрганизацииОстаткиИОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ЗапасыОрганизацииОстаткиИОбороты.Ячейка.Несоответствие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ответхранение
	|ИТОГИ
	|	СУММА(ОбъемОстаток)
	|ПО
	|	ОБЩИЕ,
	|	Ответхранение,
	|	Сорт";
	
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.Период));
	
	РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();
	
	ВыборкаОтветхранение = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОтветхранение.Следующий() Цикл
		
		Если Не ВыборкаОтветхранение.Ответхранение Тогда
			
			ОбъемСорта12 = 0;
			ОбъемСорта3  = 0;
			ВыборкаСорт = ВыборкаОтветхранение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСорт.Следующий() Цикл
				
				Если ВыборкаСорт.Сорт = Сорт12 ИЛИ ВыборкаСорт.Сорт = Сорт13 Тогда
					ОбъемСорта12 = ОбъемСорта12 + ВыборкаСорт.ОбъемОстаток;	
				КонецЕсли; 
				Если ВыборкаСорт.Сорт = Сорт3 Тогда
					ОбъемСорта3  = ОбъемСорта3  + ВыборкаСорт.ОбъемОстаток;	
				КонецЕсли; 
				ОстаткиЛесаПилмат.ОстатокБиржа12ФактСутки = ОбъемСорта12;
				ОстаткиЛесаПилмат.ОстатокБиржа12ФактНараст = ОбъемСорта12;
				ОстаткиЛесаПилмат.ОстатокБиржа3ФактСутки  = ОбъемСорта3;
				ОстаткиЛесаПилмат.ОстатокБиржа3ФактНараст  = ОбъемСорта3;
				
			КонецЦикла;
			
		Иначе
			// Неликвид
			ОстаткиЛесаПилмат.ОстатокБиржаОХФактСутки = ВыборкаОтветхранение.ОбъемОстаток;
			ОстаткиЛесаПилмат.ОстатокБиржаОХФактНараст = ВыборкаОтветхранение.ОбъемОстаток;
		КонецЕсли; 
	КонецЦикла;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня((НачалоМесяца(Объект.Период)-1)));
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня ((НачалоМесяца(Объект.Период)-1)));
	
	РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();
	
	ВыборкаОтветхранение = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОтветхранение.Следующий() Цикл
		
		Если Не ВыборкаОтветхранение.Ответхранение Тогда
			
			ОбъемСорта12 = 0;
			ОбъемСорта3  = 0;
			ВыборкаСорт = ВыборкаОтветхранение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСорт.Следующий() Цикл
				
				Если ВыборкаСорт.Сорт = Сорт12 ИЛИ ВыборкаСорт.Сорт = Сорт13 Тогда
					ОбъемСорта12 = ОбъемСорта12 + ВыборкаСорт.ОбъемОстаток;	
				КонецЕсли; 
				Если ВыборкаСорт.Сорт = Сорт3 Тогда
					ОбъемСорта3  = ОбъемСорта3  + ВыборкаСорт.ОбъемОстаток;	
				КонецЕсли; 
				ОстаткиЛесаПилмат.ОстатокБиржа12ФактФинал = ОбъемСорта12;
				ОстаткиЛесаПилмат.ОстатокБиржа3ФактФинал  = ОбъемСорта3;
				
			КонецЦикла;
			
		Иначе
			// Неликвид
			ОстаткиЛесаПилмат.ОстатокБиржаОХФактФинал = ВыборкаОтветхранение.ОбъемОстаток;
			
		КонецЕсли; 
	КонецЦикла;
	
	ЗначениеВФайл("\\rfp01-srv023\Files\1C\Exchange\ALK_TD\LOGISTIK_TO_TD_1.txt", ОстаткиЛесаПилмат);
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Поступило = Новый Структура("Поступило12ФактСутки, Поступило3ФактСутки, ПоступилоОХФактСутки, Поступило12ФактНараст, Поступило3ФактНараст, ПоступилоОХФактНараст, ПоступилоСырьяФактСутки, ПоступилоСырьяФактНараст", 0, 0, 0, 0, 0, 0, 0, 0);
	
	Сорт12 = Справочники.Сорта.НайтиПоНаименованию("1-2 сорт", Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
	Сорт13 = Справочники.Сорта.НайтиПоНаименованию("1-3 сорт", Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
	Сорт3  = Справочники.Сорта.НайтиПоНаименованию("3 сорт",   Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(алк_ЗапасыОрганизацииОбороты.КоличествоПриход, 0)) КАК КоличествоПриход,
	|	СУММА(ЕСТЬNULL(алк_ЗапасыОрганизацииОбороты.ОбъемПриход, 0)) КАК ОбъемПриход,
	|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	|	алк_ЗапасыОрганизацииОбороты.Ячейка.Несоответствие КАК Ответхранение
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.Обороты(&НачалоПериода, &КонецПериода, Регистратор, СтруктурнаяЕдиница = &П1) КАК алк_ЗапасыОрганизацииОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ЗапасыОрганизацииОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(алк_ЗапасыОрганизацииОбороты.Регистратор) = ТИП(Документ.алк_ПриемкаЛесопродукции)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ЗапасыОрганизацииОбороты.Ячейка.Несоответствие
	|ИТОГИ
	|	СУММА(КоличествоПриход),
	|	СУММА(ОбъемПриход)
	|ПО
	|	ОБЩИЕ,
	|	Ответхранение,
	|	Сорт";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();
	
	ВыборкаОтветхранение = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОтветхранение.Следующий() Цикл
		
		Если ВыборкаОтветхранение.Ответхранение = 0 Тогда
			
			ОбъемСорта12 = 0;
			ОбъемСорта3  = 0;
			ВыборкаСорт = ВыборкаОтветхранение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСорт.Следующий() Цикл
				
				Если ВыборкаСорт.Сорт = Сорт12 ИЛИ ВыборкаСорт.Сорт = Сорт13 Тогда
					ОбъемСорта12 = ОбъемСорта12 + ВыборкаСорт.ОбъемПриход;	
				КонецЕсли; 
				Если ВыборкаСорт.Сорт = Сорт3 Тогда
					ОбъемСорта3  = ОбъемСорта3  + ВыборкаСорт.ОбъемПриход;	
				КонецЕсли; 
				Поступило.Поступило12ФактСутки = ОбъемСорта12;
				Поступило.Поступило3ФактСутки  = ОбъемСорта3;
			КонецЦикла;
			
		Иначе
			// Неликвид
			Поступило.ПоступилоОХФактСутки = ВыборкаОтветхранение.ОбъемПриход;
			
		КонецЕсли; 
	КонецЦикла;	
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();
	
	ВыборкаОтветхранение = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОтветхранение.Следующий() Цикл
		
		Если ВыборкаОтветхранение.Ответхранение = 0 Тогда
			
			ОбъемСорта12 = 0;
			ОбъемСорта3  = 0;
			ВыборкаСорт = ВыборкаОтветхранение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСорт.Следующий() Цикл
				
				Если ВыборкаСорт.Сорт = Сорт12 ИЛИ ВыборкаСорт.Сорт = Сорт13 Тогда
					ОбъемСорта12 = ОбъемСорта12 + ВыборкаСорт.ОбъемПриход;	
				КонецЕсли; 
				Если ВыборкаСорт.Сорт = Сорт3 Тогда
					ОбъемСорта3  = ОбъемСорта3  + ВыборкаСорт.ОбъемПриход;	
				КонецЕсли; 
				Поступило.Поступило12ФактНараст = ОбъемСорта12;
				Поступило.Поступило3ФактНараст  = ОбъемСорта3;
			КонецЦикла;
			
		Иначе
			// Неликвид
			Поступило.ПоступилоОХФактНараст = ВыборкаОтветхранение.ОбъемПриход;
			
		КонецЕсли; 
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ЗапасыОрганизацииОбороты.КоличествоПриход КАК КоличествоПриход,
	|	алк_ЗапасыОрганизацииОбороты.ОбъемПриход КАК ОбъемПриход
	|ПОМЕСТИТЬ втДоГруппировки
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.Обороты(&НачалоПериода, &КонецПериода, Регистратор, СтруктурнаяЕдиница = &П1) КАК алк_ЗапасыОрганизацииОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(алк_ЗапасыОрганизацииОбороты.Регистратор) = ТИП(Документ.алк_ПриемкаЛесопродукции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(втДоГруппировки.КоличествоПриход), 0) КАК КоличествоПриход,
	|	ЕСТЬNULL(СУММА(втДоГруппировки.ОбъемПриход), 0) КАК ОбъемПриход
	|ИЗ
	|	втДоГруппировки КАК втДоГруппировки";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.Период));
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаРезультата = РезультатЗапроса.Выбрать(); ВыборкаРезультата.Следующий();
		Поступило.ПоступилоСырьяФактСутки = ВыборкаРезультата.ОбъемПриход;		
	КонецЕсли; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(алк_ЗапасыОрганизацииОбороты.КоличествоПриход), 0) КАК КоличествоПриход,
	|	ЕСТЬNULL(СУММА(алк_ЗапасыОрганизацииОбороты.ОбъемПриход), 0) КАК ОбъемПриход
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.Обороты(&НачалоПериода, &КонецПериода, Регистратор, СтруктурнаяЕдиница = &П1) КАК алк_ЗапасыОрганизацииОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(алк_ЗапасыОрганизацииОбороты.Регистратор) = ТИП(Документ.алк_ПриемкаЛесопродукции)";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаРезультата = РезультатЗапроса.Выбрать(); ВыборкаРезультата.Следующий();
		Поступило.ПоступилоСырьяФактНараст = ВыборкаРезультата.ОбъемПриход;		
	КонецЕсли;
	
	ЗначениеВФайл("\\rfp01-srv023\Files\1C\Exchange\ALK_TD\LOGISTIK_TO_TD_2.txt", Поступило);

	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстатки(Команда)
	ПолучитьОстаткиНаСервере();
КонецПроцедуры
